other-codes/openfoam-toolchain-with-gmsh-main/Simulation_Outputs/test_2/simpleFoam-2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


7
(
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          202854;
        startFace       308773;
    }

    front
    {
        type            empty;
        physicalType    patch;
        nFaces          202854;
        startFace       511627;
    }

    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          67;
        startFace       714481;
    }

    topAndBottom
    {
        type            patch;
        physicalType    patch;
        nFaces          134;
        startFace       714548;
    }

    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          67;
        startFace       714682;
    }

    bladenlf26_bladenlf26
    {
        type            wall;
        physicalType    patch;
        nFaces          563;
        startFace       714749;
    }

    bladenlf26_bladenlf26FLAP
    {
        type            wall;
        physicalType    patch;
        nFaces          208;
        startFace       715312;
    }

)


// ************************************************************************* //
